chore: clear and update the README
